app/controllers/client/intervention_steps_controller.rb

SELECT "intervention_types".* FROM "intervention_types"
SELECT  "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."zipcode" = $1 LIMIT 1  [["zipcode", "59100"]]
SELECT  "interventions".* FROM "interventions" WHERE "interventions"."client_token_ownership" = $1 LIMIT 1  [["client_token_ownership", "dfbeda8c8ae3b474cd2836d0bf92c1de803d0cf745941073fc"]]
---
  def show
    case step
    when :reset_session
      if session[:current_intervention_client_token_ownership].present? && session[:interventions_client_token_ownership].present?
        session[:interventions_client_token_ownership].delete session[:current_intervention_client_token_ownership]
      end
      jump_to next_step
    when :start_new_intervention
      session.delete :current_intervention_client_token_ownership
      jump_to next_step
    when :depannage
      jump_to next_step unless current_intervention.pending?
    when :define_intervention
      jump_to next_step unless current_intervention.pending?
      jump_to previous_step unless current_intervention.intervention_type.present?
      current_intervention.build_address unless current_intervention.address.present?
    when :payment
      jump_to previous_step if current_intervention.address.nil?
      if current_intervention.address.present?
        unless ZipCode.managed? current_intervention.address.zipcode
          jump_to previous_step
          flash[:error] = I18n.t('intervention_steps.errors.zipcode_not_supported')
        end
        current_intervention.build_customer unless current_intervention.customer.present?
        @pros_now_available_and_nearby = current_intervention.pros_now_available_and_nearby
      end
    when :rating
      jump_to next_step unless current_intervention.pro_on_the_road?
      current_intervention = Intervention.find_by(client_token_ownership: params[:token])

INSERT INTO "interventions" ("state", "intervention_type_id", "created_at", "updated_at", "client_token_ownership") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    case step
    when :depannage, :define_intervention
      if current_intervention.update_attributes permitted_params.except(:customer_attributes)
        (session[:interventions_client_token_ownership] ||= []) << current_intervention.client_token_ownership

UPDATE "interventions" SET "payment_method" = $1, "state" = $2, "customer_id" = $3, "updated_at" = $4 WHERE "interventions"."id" = $5  [["payment_method", "credit_card"], ["state", "pending_pro_validation"], ["customer_id", 4], ["updated_at", "2016-06-15 15:40:41.849030"], ["id", 1]]
---
  def update
    case step
    when :depannage, :define_intervention
      if current_intervention.update_attributes permitted_params.except(:customer_attributes)

SELECT  "interventions".* FROM "interventions" WHERE "interventions"."client_token_ownership" IS NULL LIMIT 1
SELECT  "interventions".* FROM "interventions" WHERE "interventions"."client_token_ownership" = $1 LIMIT 1
---
  def _current_intervention
    intervention = Intervention.find_by_client_token_ownership(
      params[:token] ||=
      params[:intervention_client_token_ownership] ||=
      params[:interventions_client_token_ownership] ||=
      session[:intervention_client_token_ownership]
    )
    if intervention.present?
      session[:current_intervention_client_token_ownership] = params[:intervention_client_token_ownership]
    else
      intervention = Intervention.find_by_client_token_ownership(
        session[:current_intervention_client_token_ownership]
      )
      if intervention.blank?