app/controllers/client/interventions_controller.rb

  def load_intervention
    @intervention = Intervention.find(params[:id])
---
SELECT  "interventions".* FROM "interventions" WHERE "interventions"."id" = $1 LIMIT 1