app/controllers/admin/areas_controller.rb

SELECT COUNT(*) FROM "areas"
SELECT  "areas".* FROM "areas"  ORDER BY "areas"."id" ASC LIMIT 1000 OFFSET 0
---
  def index
    @q = Area.ransack params[:q]
    @q.sorts = 'created_at desc' if @q.sorts.empty?
    @areas = @q.result.page(params[:page]).per(params[:per_page])

SELECT  "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."zipcode" = $1 LIMIT 1  [["zipcode", "59000"]]
---
  def zipcode
    @area = ZipCode.find_by(zipcode: params[:zipcode])

INSERT INTO "areas" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "LILLE"], ["created_at", "2016-06-15 15:40:01.545664"], ["updated_at", "2016-06-15 15:40:01.545664"]]
---
  def create
    @area = Area.new area_params
    @area.save

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_area
    @area = Area.find(params[:id])