app/controllers/admin/contractors_controller.rb

INSERT INTO "users" ("role", "firstname", "lastname", "email", "phone_number", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @contractor = User.contractors.new contractor_params
    @contractor.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def load_contractor
    @contractor = User.contractors.find(params[:id])