app/controllers/admin/customers_controller.rb

  def load_customer
    @customer = User.customers.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]