app/controllers/admin/intervention_types_controller.rb

  def index
    @intervention_types = InterventionType.all.page(params[:page])
---
SELECT  "intervention_types".* FROM "intervention_types"  ORDER BY "intervention_types"."id" ASC LIMIT 1000 OFFSET 0
SELECT COUNT(*) FROM "intervention_types"