app/controllers/admin/interventions_controller.rb

  def index
    @q = Intervention.ransack params[:q]
    @q.sorts = 'created_at desc' if @q.sorts.empty?
    @interventions = @q.result.page(params[:page]).per(params[:per_page])
---
SELECT COUNT(*) FROM "interventions"
SELECT  "interventions".* FROM "interventions"  ORDER BY "interventions"."created_at" DESC LIMIT 25 OFFSET 0

  def load_intervention
    @intervention = Intervention.find(params[:id])
---
SELECT  "interventions".* FROM "interventions" WHERE "interventions"."id" = $1 LIMIT 1  [["id", 1]]