app/controllers/pro/interventions_controller.rb

SELECT  "interventions".* FROM "interventions" WHERE (contractor_id = 7) LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "interventions" WHERE (contractor_id = 7)
---
  def index
    @q = current_pro.interventions.ransack params[:q]
    @interventions = @q.result.page(params[:page]).per(params[:per_page])