app/controllers/pro/profile_controller.rb

SELECT  "weekly_availabilities".* FROM "weekly_availabilities" WHERE "weekly_availabilities"."user_id" = $1 LIMIT 1  [["user_id", 7]]
---
  def edit
    @user.build_weekly_availability if @user.weekly_availability.blank?