app/views/admin/contractors/_user_area_fields.html.haml

    .input-group
      = f.association :area, collection: areas, disabled: @contractor.areas.pluck(:id), prompt: true, label: false, error: false
---
SELECT "areas"."id" FROM "areas" INNER JOIN "user_areas" ON "areas"."id" = "user_areas"."area_id" WHERE "user_areas"."user_id" = $1  [["user_id", 2]]