app/views/admin/interventions/edit.html.haml

    = f.input :is_ok, as: :boolean, boolean_style: :inline, label: false
    = f.input :rating, as: :select, collection: Intervention::RATINGS.map{|r| [(t "activerecord.attributes.intervention.ratings.#{r}"), r]}
---
SELECT  "interventions".* FROM "interventions" WHERE "interventions"."id" = $1 LIMIT 1  [["id", 1]]