app/views/client/intervention_steps/depannage.html.haml

SELECT "intervention_types".* FROM "intervention_types"
SELECT  "intervention_types".* FROM "intervention_types" WHERE "intervention_types"."id" = $1 LIMIT 1
---
            -# = f.label :intervention_type_id
            = f.collection_radio_buttons(:intervention_type_id, InterventionType.all, :id, :short_description, boolean_style: :inline) do |b|
              %span.radio
                = b.label(class: ((b.value == current_intervention.intervention_type_id) ? 'is-active ' : '') + InterventionType.find(b.value).kind + ' js-intervention-kind') do