app/views/admin/areas/index.html.haml

SELECT "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."area_id" = $1  [["area_id", 1]]
---
        %th= area.name
        %th= area.zip_codes.map(&:zipcode).join(', ')