app/models/intervention.rb

  def customer_attributes=(user_params)
    self.customer =
      User.where(email: user_params[:email])
      .first_or_initialize(role: 'customer')
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1

  def pros_now_available_and_nearby
    zipcode = ZipCode.find_by(zipcode: self.address.zipcode)
---
SELECT  "zip_codes".* FROM "zip_codes" WHERE "zip_codes"."zipcode" = $1 LIMIT 1